"espk" = "Applen kaiutinportti";
"ispk" = "Sisäinen";
"emic" = "Mikrofoniportti";
"imic" = "Sisäinen";
"hdpn" = "Kuulokeportti";
"lini" = "Äänen linja sisään -portti";
"lino" = "Äänen linja ulos -portti";
"spdi" = "Äänen optinen sisäänmenoportti";
"spdo" = "Äänen optinen ulostuloportti";
"pci " = "PCI-kortti";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Verkkolaite";
"blue" = "Bluetooth";
"bluh" = "Bluetooth-kuulokkeet";
"blus" = "Bluetooth-kuulokemikrofoni";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
